zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以上/debugger/FMSH/FM33A0XXEV.SVD
        <register>
          <name>PCLKCR2</name>
          <description>Peripheral bus Clock Control Register2</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000088</resetValue>
          <fields>
            <field>
              <name>PAE_PCE</name>
              <description>PAE_PCE  field description</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>SHA_PCE</name>
              <description>SHA_PCE  field description</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>CIC_PCE</name>
              <description>CIC_PCE  field description</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>WWDT_PCE</name>
              <description>WWDT_PCE  field description</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>RAMBIST_PCE</name>
              <description>RAMBIST_PCE  field description</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>NVM_PCE</name>
              <description>NVM_PCE  field description</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>DMA_PCE</name>
              <description>DMA_PCE  field description</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>LCD_PCE</name>
              <description>LCD_PCE  field description</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>AES_PCE</name>
              <description>AES_PCE  field description</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>TRNG_PCE</name>
              <description>TRNG_PCE  field description</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>CRC_PCE</name>
              <description>CRC_PCE  field description</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>PCLKCR3</name>
          <description>Peripheral bus Clock Control Register3</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>I2C1_PCE</name>
              <description>I2C1_PCE  field description</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>I2C0_PCE</name>
              <description>I2C0_PCE  field description</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>LPUART1_PCE</name>
              <description>LPUART1_PCE  field description</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>U7816_PCE</name>
              <description>U7816_PCE  field description</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>LPUART0_PCE</name>
              <description>LPUART0_PCE  field description</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>UICR_PCE</name>
              <description>UICR_PCE  field description</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>UART5_PCE</name>
              <description>UART5_PCE  field description</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>UART4_PCE</name>
              <description>UART4_PCE  field description</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>UART3_PCE</name>
              <description>UART3_PCE  field description</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>UART2_PCE</name>
              <description>UART2_PCE  field description</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>UART1_PCE</name>
              <description>UART1_PCE  field description</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>UART0_PCE</name>
              <description>UART0_PCE  field description</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>QSPI_PCE</name>
              <description>QSPI_PCE  field description</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>SPI4_PCE</name>
              <description>SPI4_PCE  field description</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>SPI3_PCE</name>
              <description>SPI3_PCE  field description</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>SPI2_PCE</name>
              <description>SPI2_PCE  field description</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>SPI1_PCE</name>
              <description>SPI1_PCE  field description</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>SPI0_PCE</name>
              <description>SPI0_PCE  field description</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>PCLKCR4</name>
          <description>Peripheral bus Clock Control Register4</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ET4CKEN</name>
              <description>ET4CKEN  field description</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>ET3CKEN</name>
              <description>ET3CKEN  field description</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>ET2CKEN</name>
              <description>ET2CKEN  field description</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>ET1CKEN</name>
              <description>ET1CKEN  field description</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>BT2CKEN</name>
              <description>BT2CKEN  field description</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>BT1CKEN</name>
              <description>BT1CKEN  field description</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>BSTIM_PCE</name>
              <description>BSTIM_PCE  field description</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>OPCCR1</name>
          <description>Peripheral Operation Clock Control Register1</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXTICKE</name>
              <description>EXTICKE  field description</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>EXTICKSEL</name>
              <description>EXTICKSEL  field description</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART1CKE</name>
              <description>LPUART1CKE  field description</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>LPUART0CKE</name>
              <description>LPUART0CKE  field description</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>LPUART1CKS</name>
              <description>LPUART1CKS  field description</description>
              <bitRange>[27:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART0CKS</name>
              <description>LPUART0CKS  field description</description>
              <bitRange>[25:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2C1CKE</name>
              <description>I2C1CKE  field description</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>I2C0CKE</name>
              <description>I2C0CKE  field description</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>I2C1CKS</name>
              <description>I2C1CKS  field description</description>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2C0CKS</name>
              <description>I2C0CKS  field description</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UART1CKE</name>
              <description>UART1CKE  field description</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>UART0CKE</name>
              <description>UART0CKE  field description</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>UART1CKS</name>
              <description>UART1CKS  field description</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UART0CKS</name>
              <description>UART0CKS  field description</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OPCCR2</name>
          <description>Peripheral Operation Clock Control Register2</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RNGPRSC</name>
              <description>RNGPRSC  field description</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NVMCKE</name>
              <description>NVMCKE  field description</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>RNGCKE</name>
              <description>RNGCKE  field description</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>LPTCKE</name>
              <description>LPTCKE  field description</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>LPTCKS</name>
              <description>LPTCKS  field description</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BSTCKE</name>
              <description>BSTCKE  field description</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>BSTCKS</name>
              <description>BSTCKS  field description</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
