zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以上/debugger/FMSH/FM33A0XXEV.SVD
      </registers>
    </peripheral>
    <peripheral>
      <name>UART</name>
      <description>UART module information</description>
      <groupName>UART</groupName>
      <baseAddress>0x40017c00</baseAddress>
      <size>32</size>
      <access>read-write</access>
      <addressBlock>
        <offset>0</offset>
        <size>0x1c</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>IRCR</name>
          <description>Infrared modulation Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IRFLAG</name>
              <description>IRFLAG  field description</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TH</name>
              <description>TH  field description</description>
              <bitRange>[14:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>TZBRG</name>
              <description>TZBRG  field description</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>UART0</name>
      <description>UART0 module information</description>
      <groupName>UART</groupName>
      <baseAddress>0x40012000</baseAddress>
      <size>32</size>
      <access>read-write</access>
      <addressBlock>
        <offset>0</offset>
        <size>0x1c</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CSR</name>
          <description>UART0 Control Status Register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BUSY</name>
              <description>BUSY  field description</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXIREN</name>
              <description>TXIREN  field description</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXTOEN</name>
              <description>RXTOEN  field description</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOSWAP</name>
              <description>IOSWAP  field description</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMATXIFCFG</name>
              <description>DMATXIFCFG  field description</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BITORD</name>
              <description>BITORD  field description</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPCFG</name>
              <description>STOPCFG  field description</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDSEL</name>
              <description>PDSEL  field description</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PARITY</name>
              <description>PARITY  field description</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXPOL</name>
              <description>RXPOL  field description</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXPOL</name>
              <description>TXPOL  field description</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXEN</name>
              <description>RXEN  field description</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>TXEN</name>
              <description>TXEN  field description</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>UART0 Interrupt Enable Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXTO_IE</name>
              <description>RXTO_IE  field description</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>RXERR_IE</name>
              <description>RXERR_IE  field description</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>RXBF_IE</name>
              <description>RXBF_IE  field description</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>TXBE_IE</name>
              <description>TXBE_IE  field description</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>TXSE_IE</name>
              <description>TXSE_IE  field description</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <description>UART0 Interrupt Status Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PERR</name>
              <description>PERR  field description</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>FERR</name>
              <description>FERR  field description</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>OERR</name>
              <description>OERR  field description</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>RXTO</name>
              <description>RXTO  field description</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>RXBF</name>
              <description>RXBF  field description</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>TXBE</name>
              <description>TXBE  field description</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>TXSE</name>
              <description>TXSE  field description</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>TODR</name>
          <description>UART0 Time-Out and Delay Register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TXDLY_LEN</name>
              <description>TXDLY_LEN  field description</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>RXTO_LEN</name>
              <description>RXTO_LEN  field description</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>RXBUF</name>
          <description>UART0 Receive Buffer</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue />
          <fields>
            <field>
              <name>RXBUF</name>
              <description>RXBUF  field description</description>
              <bitRange>[8:0]</bitRange>
              <access>read-only</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>TXBUF</name>
          <description>UART0 Transmit Buffer</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue />
          <fields>
            <field>
              <name>TXBUF</name>
              <description>TXBUF  field description</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>BGR</name>
          <description>UART0 Baud rate Generator Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000341</resetValue>
          <fields>
            <field>
              <name>SPBRG</name>
              <description>SPBRG  field description</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
