zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以上/debugger/FMSH/FM33A0XXEV.SVD
      </registers>
    </peripheral>
    <peripheral>
      <name>QSPI</name>
      <description>QSPI module information</description>
      <groupName>QSPI</groupName>
      <baseAddress>0x40000800</baseAddress>
      <size>32</size>
      <access>read-write</access>
      <addressBlock>
        <offset>0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <description>QSPI Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRESCALER</name>
              <description>PRESCALER  field description</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>ff</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PMM</name>
              <description>PMM  field description</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TOIE</name>
              <description>TOIE  field description</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMIE</name>
              <description>SMIE  field description</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FTIE</name>
              <description>FTIE  field description</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCIE</name>
              <description>TCIE  field description</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEIE</name>
              <description>TEIE  field description</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOTHR</name>
              <description>FIFOTHR  field description</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>f</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSHFT</name>
              <description>SSHFT  field description</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCEN</name>
              <description>TCEN  field description</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAEN</name>
              <description>DMAEN  field description</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ABORT</name>
              <description>ABORT  field description</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>EN</name>
              <description>EN  field description</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR</name>
          <description>QSPI Config Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CSHT</name>
              <description>CSHT  field description</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CKMODE</name>
              <description>CKMODE  field description</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>QSPI Status Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FIFOLVL</name>
              <description>FIFOLVL  field description</description>
              <bitRange>[12:8]</bitRange>
              <access>read-only</access>
              <enumeratedValues />
            </field>
            <field>
              <name>BUSY</name>
              <description>BUSY  field description</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
              <enumeratedValues />
            </field>
            <field>
              <name>TOF</name>
              <description>TOF  field description</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>SMF</name>
              <description>SMF  field description</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>FTF</name>
              <description>FTF  field description</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
              <enumeratedValues />
            </field>
            <field>
              <name>TCF</name>
              <description>TCF  field description</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>DATALEN</name>
          <description>QSPI Data Length Register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>QSPI_DATALEN</name>
              <description>QSPI_DATALEN  field description</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>CCR</name>
          <description>QSPI Communication Config Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CRM</name>
              <description>CRM  field description</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPMODE</name>
              <description>OPMODE  field description</description>
              <bitRange>[27:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMODE</name>
              <description>DMODE  field description</description>
              <bitRange>[25:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DUMCYC</name>
              <description>DUMCYC  field description</description>
              <bitRange>[22:18]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>ABSIZE</name>
              <description>ABSIZE  field description</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ABMODE</name>
              <description>ABMODE  field description</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADSIZE</name>
              <description>ADSIZE  field description</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADMODE</name>
              <description>ADMODE  field description</description>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IMODE</name>
              <description>IMODE  field description</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INSTRUCTION</name>
              <description>INSTRUCTION  field description</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR</name>
          <description>QSPI Address Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>QSPI_ADDR</name>
              <description>QSPI_ADDR  field description</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>ABR</name>
          <description>QSPI Alternate Bytes Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>QSPI_ABR</name>
              <description>QSPI_ABR  field description</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
