zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以上/debugger/FMSH/FM33A0XXEV.SVD
        <register>
          <name>IER</name>
          <description>LPTIM Interrupt Enable Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OVR4IE</name>
              <description>OVR4IE  field description</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVR3IE</name>
              <description>OVR3IE  field description</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVR2IE</name>
              <description>OVR2IE  field description</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVR1IE</name>
              <description>OVR1IE  field description</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGIE</name>
              <description>TRIGIE  field description</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVIE</name>
              <description>OVIE  field description</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CC4IE</name>
              <description>CC4IE  field description</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CC3IE</name>
              <description>CC3IE  field description</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CC2IE</name>
              <description>CC2IE  field description</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CC1IE</name>
              <description>CC1IE  field description</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <description>LPTIM Interrupt Status Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CAP4OVR</name>
              <description>CAP4OVR  field description</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAP3OVR</name>
              <description>CAP3OVR  field description</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAP2OVR</name>
              <description>CAP2OVR  field description</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAP1OVR</name>
              <description>CAP1OVR  field description</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGIF</name>
              <description>TRIGIF  field description</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVIF</name>
              <description>OVIF  field description</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CC4IF</name>
              <description>CC4IF  field description</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CC3IF</name>
              <description>CC3IF  field description</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CC2IF</name>
              <description>CC2IF  field description</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CC1IF</name>
              <description>CC1IF  field description</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>LPTIM Control Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <description>EN  field description</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR1</name>
          <description>LPTIM Capture/Compare Register1</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CCR1</name>
              <description>CCR1  field description</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>CCR2</name>
          <description>LPTIM Capture/Compare Register2</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CCR2</name>
              <description>CCR2  field description</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>CCR3</name>
          <description>LPTIM Capture/Compare Register3</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CCR3</name>
              <description>CCR3  field description</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>CCR4</name>
          <description>LPTIM Capture/Compare Register4</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CCR4</name>
              <description>CCR4  field description</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
