zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以上/debugger/FMSH/FM33A0XXEV.SVD
        <register>
          <name>EXTIDF</name>
          <description>External Interrupt Digital Filter Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXTI_DF</name>
              <description>EXTI_DF  field description</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTIISR</name>
          <description>External Interrupt and Status Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXTI</name>
              <description>EXTI  field description</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>EXTIDI</name>
          <description>External Interrupt Data Input Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXTI_DI</name>
              <description>EXTI_DI  field description</description>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FOUTSEL</name>
          <description>Frequency Output Select Register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FOUT1SEL</name>
              <description>FOUT1SEL  field description</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>13</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FOUT0SEL</name>
              <description>FOUT0SEL  field description</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>13</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IOMCR</name>
          <description>IO MUX Control Register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IOMUX_SEL</name>
              <description>IOMUX_SEL  field description</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOMUX_EN</name>
              <description>IOMUX_EN  field description</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PINWKEN</name>
          <description>Wakeup Enable Register</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WKISEL</name>
              <description>WKISEL  field description</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PINWKSEL</name>
              <description>PINWKSEL  field description</description>
              <bitRange>[23:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PINWKEN</name>
              <description>PINWKEN  field description</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
